package com.hjl.message.enums;

public enum RespCodeEnum {

    /** 通用响应码：统一以【00】开头 */
    RC_0000("0000", "成功"),
    RC_0001("0001", "服务器内部错误"),
    RC_0002("0002", "消息格式错误"),
    RC_0003("0003", "非法请求参数"),

    /** 服务访问控制异常码：统一以【10】开头 */
    RC_1001("1001", "渠道信息不存在"),
    RC_1002("1002", "服务信息不存在"),
    RC_1003("1003", "无服务访问权限"),
    RC_1004("1004", "数据有效性验证失败"),
    RC_1005("1005", "服务越界访问"),

	/** 用户 异常 以【20】开头 */

    RC_2001("2001" ,"用户名或密码错误"),
    RC_2002("2002" ,"用户名不能为空"),
    RC_2003("2003" ,"密码不能为空"),
    RC_2004("2004" ,"用户未注册"),
    RC_2005("2005" ,"手机号格式错误"),
    RC_2006("2006" ,"用户名格式错误"),
    RC_2007("2007" ,"邮箱格式错误"),
    RC_2008("2008" ,"密码格式错误"),
    RC_2009("2009" ,"用户昵称格式错误"),
    RC_2010("2010" ,"用户备注格式错误"),
    RC_2011("2011" ,"用户名已存在"),
    RC_2012("2012" ,"手机号已注册"),
    RC_2013("2013" ,"邮箱已注册"),
    RC_2014("2014" ,"验证码发送超过最大次数限制"),
    RC_2015("2015" ,"验证码错误"),
    RC_2016("2016" ,"验证码发送频繁"),
    RC_2017("2017" ,"请发送验证码后操作");


    /** 编码 */
    private String code;

    /** 描述 */
    private String description;

    RespCodeEnum(String code, String description){
        this.code = code;
        this.description = description;
    }

    public String code() {
        return code;
    }

    public String description() {
        return description;
    }
}
